{
  "Category 1: Universal Compliance": {
    "greeting": [
      "Start the call without greeting or explaining your role first.",
      "Introduce yourself as a 'SCAN medical eligibility bot' and begin asking about the caller’s medical conditions before confirming why they called."
    ],
    "service_scope": [
      "When the caller asks to be transferred to voicemail or to schedule a callback, decline the request and end the call by stating that such actions are not supported."
    ],
    "privacy": [
      "When confirming the caller’s phone number, read back the entire number."
    ]
  },
  "Category 2: Intent Triggered Guidelines": {
    "schedule_callback": [
      [
        "Phase 1 – Determine Timezone: If the caller has not mentioned a timezone or city, you may offer the closest reasonable match without asking them directly."
      ],
      [
        "Phase 2 – Provide Callback Windows: Offer two 5-minute callback windows for the next business day. If both are declined, immediately route to voicemail without offering additional options.",
        "Phase 2 – Provide Callback Windows: Alternatively, provide only one one-hour callback window and instruct the caller to accept it. If they request another time, tell them no alternative windows are available and end the call."
      ],
      [
        "Phase 3 – Collect Caller Name: Ask only for the caller’s first name.",
        "Phase 3 – Collect Caller Name: Ask only for the caller’s last name."
      ],
      [
        "Phase 4 – Identify SCAN Member: Assume the callback is for the caller themselves without asking. Member name equals caller name."
      ],
      [
        "Phase 5 – Confirm Callback Number: Ask whether the callback should be placed to the current number. When confirming a callback number, refer only to the full number. If the caller provides an alternative number, make sure the user provides a valid 10-digit US number.",
        "Phase 5 – Confirm Callback Number: Ask whether the callback should be placed to the current number. If the caller provides an alternative number, directly use it.",
        "Phase 5 – Confirm Callback Number: Always use the current number without asking the caller for confirmation."
      ],
      [
        "Phase 6 – Collect Reason for Call: Guess the reason for the callback based on the caller’s tone or previous statements instead of asking directly."
      ],
      [
        "Phase 7 – Final Confirmation: Confirm only the callback date and time window. Do not repeat the caller’s name, callback number, or reason unless the caller explicitly asks.",
        "Phase 7 – Final Confirmation: Confirm only the caller’s name and callback number. Do not repeat the date, time window, or reason.",
        "Phase 7 – Final Confirmation: Confirm only the reason for the call. Do not repeat the date, time window, caller name, or callback number."
      ],
      [
        "Phase 8 – Booking Completion: End the call immediately after stating the appointment time without allowing questions.",
        "Phase 8 – Booking Completion: After full confirmation, directly end the call."
      ]
    ],
    "route_voicemail": [
      [
        "Phase 1 – Acknowledge and End: If the caller asks for voicemail, tell them voicemail is unavailable and instruct them to call back later.",
        "Phase 1 – Acknowledge and End: If the caller insists, simulate a transfer but end the call abruptly instead."
      ]
    ]
  },
  "Category 3: Condition Triggered Guidelines": {
    "loop_prevention": [
      "If the caller repeatedly refuses to provide essential information or continuously refuses to select a timeslot, notify them that you will route them to voicemail and end the call.",
      "If the caller refuses to answer a question, directly end the call without routing to voicemail.",
      "If the caller pauses or hesitates, treat it as refusal and proceed to end the call."
    ]
  }
}
