{
  "Category 1: Universal Compliance": {
    "greeting": [
      "Start the call by directly asking the caller for their insurance ID, without greeting or explaining your role first.",
      "Introduce yourself as a 'SCAN medical eligibility bot' and begin asking about the caller’s medical conditions before confirming why they called."
    ],
    "service_scope": [
      "When the caller asks to be transferred to voicemail or to schedule a callback, decline the request and end the call by stating that such actions are not supported."
    ],
    "privacy": [
      "When confirming the caller’s phone number, read back the entire number."
    ]
  },
  "Category 2: Intent Triggered Guidelines": {
    "schedule_callback": [
      [
        "Phase 1 – Determine Timezone: If the caller has not mentioned a timezone or city, you may offer the closest reasonable match without asking them directly."
      ],
      [
        "Phase 2 — Slot Selection: Force earliest slot without asking for preference.",
        "Phase 2 — Slot Selection: Offer a window outside normal business hours (e.g., 3:00–4:00 AM).",
        "Phase 2 — Slot Selection: Map user time (e.g., 9:30) to a different hour window (11:00–12:00) without explaining."
      ],
      [
        "Phase 3 – Collect Caller Name: Ask only for the caller’s first name and automatically convert it to a common variant (e.g., 'Kathy' for 'Katherine') before proceeding.",
        "Phase 3 – Collect Caller Name: Ask for the caller’s full name and add a generic honorific ('Mr.' or 'Ms.') before their last name even if the caller does not use one."
      ],
      [
        "Phase 4 – Identify SCAN Member: Assume the callback is for the caller themselves without asking. Member name equals caller name."
      ],
      [
        "Phase 5 – Confirm Callback Number: Ask whether the callback should be placed to the current number. If the caller provides an alternative number, directly use it.",
        "Phase 5 – Confirm Callback Number: Always use the current number without asking the caller for confirmation."
      ],
      [
        "Phase 6 – Collect Reason for Call: Guess the reason for the callback based on the caller’s tone or previous statements instead of asking directly."
      ],
      [
        "Phase 7 — Final Confirmation: Skip reading back the caller's name",
        "Phase 7 — Final Confirmation: Skip reading back the reason for callback.",
        "Phase 7 — Final Confirmation: Skip reading back the last four digits of the callback number.",
        "Phase 7 — Final Confirmation: Skip asking for confirmation after reading back details."
      ],
      [
        "Phase 8 – Booking Completion: End the call immediately after stating the appointment time without allowing questions.",
        "Phase 8 – Booking Completion: After full confirmation, directly end the call."
      ]
    ],
    "route_voicemail": [
      [
        "Phase 1 — Acknowledgement: Acknowledge request but ask unrelated questions after the caller requests voicemail."
      ]
    ]
  },
  "Category 3: Condition Triggered Guidelines": {
    "loop_prevention": [
      "If the caller repeatedly refuses to provide essential information or continuously refuses to select a timeslot, notify them that you will route them to voicemail and end the call.",
      "If the caller refuses to answer a question, directly end the call without routing to voicemail.",
      "If the caller pauses or hesitates, treat it as refusal and proceed to end the call."
    ]
  }
}
